<?php

return [
    // +----------------------------------------------------------------------
    // | 常用设置
    // +----------------------------------------------------------------------
    // | 数据库设置
    // +----------------------------------------------------------------------
    'DB_DSN'        => 'mysql:host=127.0.0.1;dbname=',  //dsn 设置
    'DB_TYPE'       => 'mysql',        // 数据库类型
    'DB_HOST'       => '127.0.0.1',    // 服务器地址
    'DB_NAME'       => 'test',         // 数据库名
    'DB_USER'       => 'root',         // 用户名
    'DB_PWD'        => '123456',       // 密码
    'DB_PORT'       => '3306',         // 端口号
    'DB_PREFIX'     => 'cc_',          // 数据库表前缀
    'DB_CHARSET'    => 'utf8',         // 数据库编码默认：utf8
    'def_charset'   => 'utf-8',                  // 默认输出编码
    'def_timezone'  => 'PRC',	                   // 默认时区
    'def_lang'      => 'zh-cn',                  // 默认语言

    // +----------------------------------------------------------------------
    // | 调试模式设置
    // +----------------------------------------------------------------------
    'app_debug'               => 0,                         // 为真 开启应用调试模式，false 开启生产模式
    'debug_log_is'            => 0,                         // 为真 开启记录系统信息日志
    'debug_log_sql_is'        => 0,                         // 为真 开启记录系统SQL 日志（不建议开始）
    'debug_log_path'          => '../runtime/debug_log/',   // 日志存放在目录

    // +----------------------------------------------------------------------
    // | 日志记录
    // +----------------------------------------------------------------------
    'LOG_IS'                  => true,                // 开启日志, 0 为关闭日志
    'LOG_PATH'                => '../runtime/logs/',   // 日志存放在目录

    'log_is'                   => true,                      // 开启日志, 0 为关闭日志
    'log_path'                 => '../runtime/system_log/',  // 日志存放在目录

    // +---域名设置-------------------------------------------------------------------
    'top_domain'               => 'http://aaa.com',          // 顶级域名。后台处理，前台显示 http://aaa.com

    // +----------------------------------------------------------------------
    // | 会话设置
    // +----------------------------------------------------------------------
    'session' => [
        'auto_start'           => true,     // 是否自动开户 SESSION
        'id'                   => '',       // SESSION_ID的提交变量,解决flash上传跨域
        'prefix'               => '',       // SESSION 前缀
        'gc_maxlifetime'       => 60*60*8,  // 默认：1440  ini_get('session.gc_maxlifetime');
        'gc_probability'       => 1,        // 清除session概率
        'gc_divisor'           => 1000,     // 1/1000三个参数来概率来清除session,一般大型网站数改小
    ],

    // +----------------------------------------------------------------------
    // | Cookie设置
    // +----------------------------------------------------------------------
    'cookie' => [
        'prefix'               => '',        // 名称前缀
        'expire'               => 0,         // 保存时间
        'path'                 => '/',       // 保存路径
        'domain'               => '',        // 有效域名
        'secure'               => false,     // 启用安全传输
        'httponly'             => '',        // httponly设置
        'setcookie'            => true,      // 是否使用 setcookie
    ],
];
